xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_adc.h
/** @defgroup ADC_Error_Code ADC Error Code
  * @{
  */
#define HAL_ADC_ERROR_NONE              (0x00U)   /*!< No error                                    */
#define HAL_ADC_ERROR_INTERNAL          (0x01U)   /*!< ADC peripheral internal error (problem of clocking,
                                                       enable/disable, erroneous state, ...)       */
#define HAL_ADC_ERROR_DMA               (0x02U)   /*!< DMA transfer error                          */
#define HAL_ADC_ERROR_OVR               (0x04U)   /*!< Overrun error                               */
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
#define HAL_ADC_ERROR_INVALID_CALLBACK  (0x10U)   /*!< Invalid Callback error */
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup ADC_HAL_EC_COMMON_CLOCK_SOURCE  ADC common - Clock source
  * @{
  */

#define ADC_CLOCK_SYNC_PCLK_DIV1           (ADC_CCR_CKMODE_1 | ADC_CCR_CKMODE_0)  /*!< ADC synchronous clock from AHB clock
                                           without prescaler */
#define ADC_CLOCK_SYNC_PCLK_DIV2           (ADC_CCR_CKMODE_0)  /*!< ADC synchronous clock from AHB clock
                                           with prescaler division by 2 */
#define ADC_CLOCK_SYNC_PCLK_DIV4           (ADC_CCR_CKMODE_1)  /*!< ADC synchronous clock from AHB clock
                                           with prescaler division by 4 */
#define ADC_CLOCK_ASYNC_DIV1               (0x00000000UL)      /*!< ADC asynchronous clock without
                                           prescaler */
#define ADC_CLOCK_ASYNC_DIV2               (ADC_CCR_PRESC_0)      /*!< ADC asynchronous clock with prescaler
                                           division by 2   */
#define ADC_CLOCK_ASYNC_DIV4               (ADC_CCR_PRESC_1)      /*!< ADC asynchronous clock with prescaler
                                           division by 4   */
#define ADC_CLOCK_ASYNC_DIV6               (ADC_CCR_PRESC_1 | ADC_CCR_PRESC_0)      /*!< ADC asynchronous clock with prescaler
                                           division by 6   */
#define ADC_CLOCK_ASYNC_DIV8               (ADC_CCR_PRESC_2)      /*!< ADC asynchronous clock with prescaler
                                           division by 8   */
#define ADC_CLOCK_ASYNC_DIV10              (ADC_CCR_PRESC_2 | ADC_CCR_PRESC_0)     /*!< ADC asynchronous clock with prescaler
                                           division by 10  */
#define ADC_CLOCK_ASYNC_DIV12              (ADC_CCR_PRESC_2 | ADC_CCR_PRESC_1)     /*!< ADC asynchronous clock with prescaler
                                           division by 12  */
#define ADC_CLOCK_ASYNC_DIV16              (ADC_CCR_PRESC_2 | ADC_CCR_PRESC_1 | ADC_CCR_PRESC_0)     /*!< ADC asynchronous clock with prescaler
                                           division by 16  */
#define ADC_CLOCK_ASYNC_DIV32              (ADC_CCR_PRESC_3)     /*!< ADC asynchronous clock with prescaler
                                           division by 32  */
#define ADC_CLOCK_ASYNC_DIV64              (ADC_CCR_PRESC_3 | ADC_CCR_PRESC_0)     /*!< ADC asynchronous clock with prescaler
                                           division by 64  */
#define ADC_CLOCK_ASYNC_DIV128             (ADC_CCR_PRESC_3 | ADC_CCR_PRESC_1)    /*!< ADC asynchronous clock with prescaler
                                           division by 128 */
#define ADC_CLOCK_ASYNC_DIV256             (ADC_CCR_PRESC_3 | ADC_CCR_PRESC_1 | ADC_CCR_PRESC_0)    /*!< ADC asynchronous clock with prescaler
                                           division by 256 */
/**
  * @}
  */

/** @defgroup ADC_HAL_EC_RESOLUTION  ADC instance - Resolution
  * @{
  */
#define ADC_RESOLUTION_12B                 (LL_ADC_RESOLUTION_12B)  /*!< ADC resolution 12 bits */
#define ADC_RESOLUTION_10B                 (LL_ADC_RESOLUTION_10B)  /*!< ADC resolution 10 bits */
#define ADC_RESOLUTION_8B                  (LL_ADC_RESOLUTION_8B)   /*!< ADC resolution  8 bits */
#define ADC_RESOLUTION_6B                  (LL_ADC_RESOLUTION_6B)   /*!< ADC resolution  6 bits */
/**
  * @}
  */

#if defined(VREFBUF)
/** @defgroup ADC_VrefBuf ADC VrefBuf
  * @{
  */  
#define ADC_VREFBUF_VCCA                   (0x00000000U)                  /*!< VREFBUF VCCA   */
#define ADC_VREFBUF_1P024V                 SYSCFG_VREFBUF_1P024V          /* Vrefbuf 1.024V */  
#define ADC_VREFBUF_1P5V                   SYSCFG_VREFBUF_1P5V            /* Vrefbuf 1.5V */  
#define ADC_VREFBUF_2P048V                 SYSCFG_VREFBUF_2P048V          /* Vrefbuf 2.048V */  
#define ADC_VREFBUF_2P5V                   SYSCFG_VREFBUF_2P5V            /* Vrefbuf 2.5V */  
#define ADC_VREFBUF_0P6V                   SYSCFG_VREFBUF_0P6V            /* Vrefbuf 0.6V */ 
/**
  * @}
  */
#endif /* VREFBUF */

/** @defgroup ADC_HAL_EC_DATA_ALIGN ADC conversion data alignment
  * @{
  */
#define ADC_DATAALIGN_RIGHT                (LL_ADC_DATA_ALIGN_RIGHT) /*!< ADC conversion data alignment: right aligned
                                           (alignment on data register LSB bit 0)*/
#define ADC_DATAALIGN_LEFT                 (LL_ADC_DATA_ALIGN_LEFT)  /*!< ADC conversion data alignment: left aligned
                                           (alignment on data register MSB bit 15)*/
/**
  * @}
  */

/** @defgroup ADC_Scan_mode ADC sequencer scan mode
  * @{
  */
#define ADC_SCAN_DISABLE         (0x00000000UL)       /*!< Scan mode disabled */
#define ADC_SCAN_ENABLE          (0x00000001UL)       /*!< Scan mode enabled  */
/**
  * @}
  */

/** @defgroup ADC_regular_external_trigger_source ADC group regular trigger source
  * @{
  */
#define ADC_SOFTWARE_START               (LL_ADC_REG_TRIG_SOFTWARE       )
#define ADC_EXTERNALTRIG_T1_TRGO         (LL_ADC_REG_TRIG_EXT_TIM1_TRGO  )
#define ADC_EXTERNALTRIG_T1_CC1          (LL_ADC_REG_TRIG_EXT_TIM1_CH1   )
#define ADC_EXTERNALTRIG_T1_CC2          (LL_ADC_REG_TRIG_EXT_TIM1_CH2   )
#define ADC_EXTERNALTRIG_T1_CC3          (LL_ADC_REG_TRIG_EXT_TIM1_CH3   )
#define ADC_EXTERNALTRIG_T1_CC4          (LL_ADC_REG_TRIG_EXT_TIM1_CH4   )
#define ADC_EXTERNALTRIG_T2_TRGO         (LL_ADC_REG_TRIG_EXT_TIM2_TRGO  )
#define ADC_EXTERNALTRIG_T2_CC1          (LL_ADC_REG_TRIG_EXT_TIM2_CH1   )
#define ADC_EXTERNALTRIG_T3_CC1          (LL_ADC_REG_TRIG_EXT_TIM3_CH1   )
#define ADC_EXTERNALTRIG_T3_TRGO         (LL_ADC_REG_TRIG_EXT_TIM3_TRGO  )
#define ADC_EXTERNALTRIG_T15_TRGO        (LL_ADC_REG_TRIG_EXT_TIM15_TRGO )
#define ADC_EXTERNALTRIG_EXT_IT11        (LL_ADC_REG_TRIG_EXT_EXTI_LINE11)
#define ADC_EXTERNALTRIG_EXT_IT15        (LL_ADC_REG_TRIG_EXT_EXTI_LINE15)

/**
  * @}
  */

